let monsters = []
let walls = {
  texture: '█',
  coordinates: [
    {x: 6, y: 1},
    {x: 6, y: 2},
    {x: 6, y: 3},
    {x: 11, y: 3},
    {x: 12, y: 3},
    {x: 13, y: 3},
    {x: 14, y: 3},
    {x: 15, y: 3},
    {x: 11, y: 4},
    {x: 11, y: 5},
    {x: 11, y: 6},
    {x: 11, y: 7},
    {x: 30, y: 3},
    {x: 30, y: 4},
    {x: 30, y: 5},
    {x: 30, y: 6},
    {x: 30, y: 7},
    {x: 33, y: 3},
    {x: 34, y: 3},
    {x: 35, y: 3},
    {x: 36, y: 3},
    {x: 37, y: 3},
    {x: 38, y: 3},
    {x: 39, y: 3},
    {x: 40, y: 3},
    {x: 37, y: 2},
    {x: 37, y: 1},
  ],
}
let cases = {
  texture: 'C',
  coordinates: [
    {x: 31, y: 3},
    {x: 32, y: 3},
  ]
}